[
  {
    "url": "http://www.seattletimes.com/seattle-news/education/too-many-dead-white-dudes-seattle-u-students-protest-programs-curriculum/",
    "title": "Too many ‘dead white dudes’? Seattle U students protest program’s curriculum",
    "text": "Students held a sit-in over Seattle University's Matteo Ricci College curriculum, which some students said focuses too narrowly on Western ideas and history."
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/dead-white-dudes-dont-corner-the-market-on-words-of-wisdom/",
    "title": "Dead white dudes don’t corner the market on words of wisdom",
    "text": "Seattle University students are right that most schooling is dominated by dead white dudes. But it’s not something live white dudes have to get all defensive about, writes Seattle Times columnist Danny Westneat."
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/seattle-a-model-for-dealing-with-race-inequity-says-professor/",
    "title": "Seattle on a path toward the ideal on tackling race inequity, professor says",
    "text": "Professor Susan Gooden of Virginia Commonwealth University has studied the reluctance of governments to address social inequity. She urges government managers to attack racism head-on."
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/education/what-its-like-to-be-black-on-campus-isolating-exhausting-calling-for-change/",
    "title": "What it’s like to be black on campus: isolated, exhausted, calling for change",
    "text": "For the small number of black students on Washington college campuses, a subtle undercurrent of racism can make higher education a hostile place."
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/honor-mlk-legacy-with-active-citizen-engagement/",
    "title": "Honor MLK legacy with active citizen engagement",
    "text": "The social-justice achievements of the 1960s need shoring up today."
  },
  {
    "url": "http://www.seattletimes.com/opinion/the-transformative-power-of-higher-education-for-all/",
    "title": "The transformative power of higher education — for all",
    "text": "After Dr. King's assassination, NYU made a new push to combat educational inequality. Hear from one of 77 black and Hispanic students admitted in that 1968 freshman class."
  },
  {
    "url": "http://www.seattletimes.com/education-lab/how-a-diverse-yet-divided-school-blended-segregated-classes/",
    "title": "How a diverse yet divided school blended ‘segregated’ classes",
    "text": "After experiencing a striking racial imbalance, Leschi Elementary altered a popular program that had drawn white families to a traditionally black school."
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/crime/seattles-black-community-reels-from-rash-of-killings-of-youth/",
    "title": "Seattle’s black community reels from killings of young men",
    "text": "A rash of shootings has cut deeply through Seattle’s black community, and left many struggling for answers."
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/marissa-johnson-a-generation-of-activists-who-believe-in-disruption/",
    "title": "Marissa Johnson part of a new, disruptive generation of activists",
    "text": "Once an ardent theology student, Marissa Johnson has joined a new generation of confrontational activists swept up in the Black Lives Matter movement."
  },
  {
    "url": "http://www.seattletimes.com/education-lab/race-dramatically-skews-discipline-even-in-elementary-school/",
    "title": "Race dramatically skews discipline, even in elementary school",
    "text": "The racial gap starts as young as age 5, and it’s persistent enough that civil-rights investigators are taking note."
  },
  {
    "url": "http://www.seattletimes.com/business/rev-jackson-tech-companies-are-lsquoboycotting-our-talentrsquo/",
    "title": "Rev. Jackson: Tech companies are ‘boycotting our talent’",
    "text": "The Rev. Jesse Jackson spoke with <em>The Seattle Times</em> in 2014 about his campaign for greater opportunity for minorities and women in high-tech jobs."
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/wersquore-no-better-than-ferguson-maybe-worse/",
    "title": "We’re no better than Ferguson; maybe worse",
    "text": "It’s just as unlikely for cops to get charged for bad deeds here as it is in Missouri."
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/garfieldrsquos-black-student-union-lsquothis-is-our-time-to-speakrsquo/",
    "title": "Garfield’s Black Student Union: ‘This is our time … to speak’",
    "text": "Garfield High’s Black Student Union, founded during the 1960s civil-rights movement, lately has grown from just a handful of participants to dozens."
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/race-and-police-four-seattle-area-families-share-concerns-post-ferguson/",
    "title": "Race and police: Four Seattle-area families share concerns post-Ferguson",
    "text": "Bits of advice on how to survive encounters with police have been passed down for generations in African-American families."
  },
  {
    "url": "http://www.seattletimes.com/pacific-nw-magazine/volunteers-hunt-for-the-truth-about-our-place-in-the-civil-war/",
    "title": "Volunteers hunt for the truth about our place in the Civil War",
    "text": "Seattle historian Lorraine McConaghy digs up untold stories of the Pacific Northwest during the Civil War."
  },
  {
    "url": "http://www.seattletimes.com/opinion/trayvon-martins-killing-prompts-parents-to-have-the-talk-with-their-sons/",
    "title": "Trayvon Martin’s killing prompts parents to have ‘The Talk’ with their sons",
    "text": "Moved by the senseless killing of 17-year-old Trayvon Martin in Florida, Times editorial columnist Lynne Varner sits her son down to have \"The Talk.\""
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/diaz-on-doj-report-department-is-not-broken/",
    "title": "Diaz on DOJ report: ‘Department is not broken’",
    "text": "In a blistering report, a federal civil-rights investigation found the Seattle Police Department engaged in a \"pattern or practice\" of violating the constitutional rights of citizens by using excessive force due, in part, to a lack of oversight at the top ranks of the department."
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/culture-of-mistrust-behind-spds-woes/",
    "title": "Culture of mistrust behind SPD’s woes",
    "text": "A rare civil-rights investigation of the Seattle Police Department indicates federal officials have decided it's too late for police and city leaders to address the issues on their own."
  },
  {
    "url": "http://www.seattletimes.com/pacific-nw-magazine/kent-preacher-is-busting-the-notion-of-a-black-church/",
    "title": "Kent preacher is busting the notion of a ‘black church’",
    "text": "The Rev. Leslie Braxton is on a mission to diversify his congregation — breaking down racial barriers and busting the notion of a traditional \"black church.\""
  },
  {
    "url": "http://www.seattletimes.com/seattle-news/education/the-resegregation-of-seattles-schools/",
    "title": "The resegregation of Seattle’s schools",
    "text": "Nearly three decades after Seattle Public Schools integrated almost all its schools through busing, that racial balance is long gone."
  }
]