[
  {
    "index": 1,
    "question": "What year was Martin Luther King Jr. assassinated?",
    "note": "1968: He was killed in Memphis, Tenn., where he had gone to support a strike by sanitation workers."
  },
  {
    "index": 2,
    "question": "Where did Rosa Parks become famous?",
    "note": "On a bus in Montgomery, Alabama. Her arrest Dec. 1 lead to a yearlong boycott aimed to desegregate the bus system."
  },
  {
    "index": 3,
    "question": "Which president signed the first major civil rights act of this century?",
    "note": "Lyndon B. Johnson. He signed the Civil Rights Act of 1964 on July 2 that year."
  },
  {
    "index": 4,
    "question": "Which president signed the law creating the Martin Luther King holiday?",
    "note": "Ronald Reagan. It was in November 1983, more than 15 years after King was killed."
  },
  {
    "index": 5,
    "question": "What was the name of King's first book?",
    "note": "Stride Toward Freedom. He was only 29 years old when it was published."
  },
  {
    "index": 6,
    "question": "Where was the tactic of the sit-in protest first used?",
    "note": "At a Woolworth's lunch counter in Greensboro, North Carolina. The 1960 protest was one of the key moments in the civil-rights movement."
  },
  {
    "index": 7,
    "question": "Where did King deliver his \"I Have a Dream\" speech?",
    "note": "At the Lincoln Memorial. He addressed a quarter-million people who turned out for the 1963 March on Washington."
  },
  {
    "index": 8,
    "question": "Who is the protagonist of the Charles Johnson novel, Dreamer?",
    "note": "A bodyguard in Chicago. In the novel, this man was picked because of his resemblance to King."
  },
  {
    "index": 9,
    "question": "What foreign figure has King been compared to?",
    "note": "Mohandas Gandhi. King admired Gandhi greatly, and traveled to India in 1959."
  },
  {
    "index": 10,
    "question": "What year was the Martin Luther King national holiday first observed?",
    "note": "1986. The first legislation for the holiday had been proposed almost 18 years earlier."
  },
  {
    "index": 11,
    "question": "What black leader was killed five years before King's assassination?",
    "note": "Medgar Evers. The NAACP leader was murdered June 12, 1963."
  },
  {
    "index": 12,
    "question": "Why was King arrested in 1956?",
    "note": "Driving too fast. (He was driving 30 mph in a 25 mph zone.) That same year, in the very early days of the civil-rights movement, his house was bombed."
  }
]