[
  {
    "year": 1929,
    "category": "king",
    "date": "Jan. 15",
    "text": "Michael Luther King Jr., later renamed Martin, is born to schoolteacher Alberta King and Baptist minister Michael Luther King in Atlanta, Ga."
  },
  {
    "year": 1948,
    "category": "king",
    "text": "King graduates from Morehouse College in Atlanta with a B.A."
  },
  {
    "year": 1951,
    "category": "king",
    "text": "Graduates with a B.D. from Crozer Theological Seminary in Chester, Pa."
  },
  {
    "year": 1953,
    "category": "king",
    "date": "June 18",
    "text": "King marries Coretta Scott in Marion, Ala. They will have four children: Yolanda Denise (b.1955), Martin Luther King III (b.1957), Dexter (b.1961), Bernice Albertine (b.1963)."
  },
  {
    "year": 1954,
    "category": "rights",
    "text": "Brown vs. Board of Education: U.S. Supreme Court bans segregation in public schools."
  },
  {
    "year": 1954,
    "category": "king",
    "date": "September",
    "text": "King moves to Montgomery, Ala., to preach at Dexter Avenue Baptist Church."
  },
  {
    "year": 1955,
    "category": "king",
    "text": "After coursework at New England colleges, King finishes his Ph.D. in systematic theology."
  },
  {
    "year": 1955,
    "category": "rights",
    "text": "Bus boycott launches in Montgomery, Ala., after an African-American woman, Rosa Parks, is arrested December 1 for refusing to give up her seat to a white person."
  },
  {
    "year": 1956,
    "category": "king",
    "date": "Jan. 26",
    "text": "King is arrested for driving 30 mph in a 25 mph zone."
  },
  {
    "year": 1956,
    "category": "king",
    "date": "Jan. 30",
    "text": "King's house is bombed."
  },
  {
    "year": 1956,
    "category": "rights",
    "date": "Dec. 21",
    "text": "After more than a year of bus boycotts and a legal fight, the Montgomery buses desegregate."
  },
  {
    "year": 1957,
    "category": "king",
    "date": "January",
    "text": "Black ministers form what becomes known as the Southern Christian Leadership Conference. King is named first president one month later."
  },
  {
    "year": 1957,
    "category": "king",
    "text": "In this typical year of demonstrations, King travels 780,000 miles and makes 208 speeches."
  },
  {
    "year": 1957,
    "category": "rights",
    "text": "Garfield High School becomes the first Seattle high school with a more than 50 percent nonwhite student body."
  },
  {
    "year": 1957,
    "category": "rights",
    "text": "At previously all-white Central High in Little Rock, Ark., 1,000 paratroopers are called by President Eisenhower to restore order and escort nine black students."
  },
  {
    "year": 1958,
    "category": "king",
    "text": "King's first book, \"Stride Toward Freedom,\" is published, recounting his recollections of the Montgomery bus boycott. While King is promoting his book in a Harlem book store, an African American woman stabs him."
  },
  {
    "year": 1959,
    "category": "king",
    "text": "King visits India. He had a lifelong admiration for Mohandas K. Gandhi, and credited Gandhi's passive resistance techniques for his civil-rights successes."
  },
  {
    "year": 1960,
    "category": "king",
    "text": "King leaves for Atlanta to pastor his father's church, Ebenezer Baptist Church."
  },
  {
    "year": 1960,
    "category": "rights",
    "text": "The sit-in protest movement begins in February at a Woolworth's lunch counter in Greensboro, N.C. and spreads across the nation."
  },
  {
    "year": 1961,
    "category": "rights",
    "text": "Freedom rides begin from Washington, D.C: Groups of black and white people ride buses through the South to challenge segregation."
  },
  {
    "year": 1961,
    "category": "rights",
    "text": "King makes his only visit to Seattle. He visits numerous places, including two morning assemblies at Garfield High School."
  },
  {
    "year": 1962,
    "category": "king",
    "text": "King meets with President John F. Kennedy to urge support for civil rights."
  },
  {
    "year": 1962,
    "category": "rights",
    "text": "Blacks become the majority at Garfield High, 51 percent of the student population - a first for Seattle. The school district average is 5.3 percent."
  },
  {
    "year": 1962,
    "category": "rights",
    "text": "Two killed, many injured in riots as James Meredith is enrolled as the first black at the University of Mississippi."
  },
  {
    "year": 1963,
    "category": "king",
    "text": "King leads protests in Birmingham for desegregated department store facilities, and fair hiring."
  },
  {
    "year": 1963,
    "category": "king",
    "date": "April",
    "text": "Arrested after demonstrating in defiance of a court order, King writes \"Letter From Birmingham Jail.\" This eloquent letter, later widely circulated, becomes a classic of the civil-rights movement."
  },
  {
    "year": 1963,
    "category": "rights",
    "text": "Police arrest King and other ministers demonstrating in Birmingham, Ala., then turn fire hoses and police dogs on the marchers."
  },
  {
    "year": 1963,
    "category": "rights",
    "date": "June 12",
    "text": "Medgar Evers, NAACP leader, is murdered as he enters his home in Jackson, Miss."
  },
  {
    "year": 1963,
    "category": "rights",
    "text": "About 1,300 people march from the Central Area to downtown Seattle, demanding greater job opportunities for blacks in department stores. The Bon Marche promises 30 new jobs for blacks."
  },
  {
    "year": 1963,
    "category": "rights",
    "text": "About 400 people rally at Seattle City Hall to protest delays in passing an open-housing law. In response, the city forms a 12-member Human Rights Commission but only two blacks are included, prompting a sit-in at City Hall and Seattle's first civil-rights arrests."
  },
  {
    "year": 1963,
    "category": "king",
    "date": "Aug. 28",
    "text": "250,000 civil-rights supporters attended the March on Washington. At the Lincoln Memorial, King delivers the famous \"I have a dream\" speech."
  },
  {
    "year": 1963,
    "category": "rights",
    "text": "250,000 people attend the March on Washington, D.C. urging support for pending civil-rights legislation. The event is highlighted by King's \"I have a dream\" speech."
  },
  {
    "year": 1963,
    "category": "rights",
    "text": "The Seattle School District implements a voluntary racial transfer program, mainly aimed at busing black students to mostly white schools."
  },
  {
    "year": 1963,
    "category": "rights",
    "date": "Sep. 15",
    "text": "Four girls are killed in a bombing at the Sixteenth Street Baptist Church in Birmingham, Ala."
  },
  {
    "year": 1964,
    "category": "rights",
    "text": "Seattle City Council agrees to put together an open-housing ordinance but insists on putting it on the ballot. Voters defeat it by a 2-to-1 ratio. It will be four more years before an open-housing ordinance becomes law."
  },
  {
    "year": 1964,
    "category": "rights",
    "text": "Three civil-rights workers are murdered in Mississippi."
  },
  {
    "year": 1964,
    "category": "rights",
    "date": "July 2",
    "text": "President Johnson signs the Civil Rights Act of 1964."
  },
  {
    "year": 1964,
    "category": "king",
    "text": "King's book \"Why We Can't Wait\" is published."
  },
  {
    "year": 1964,
    "category": "king",
    "text": "King visits with West Berlin Mayor Willy Brant and Pope Paul VI."
  },
  {
    "year": 1964,
    "category": "king",
    "date": "Dec. 10",
    "text": "King wins the Nobel Peace Prize."
  },
  {
    "year": 1964,
    "category": "rights",
    "text": "Out of 955 people employed by the Seattle Fire Department, just two are African American, and only one is Asian, account for less than 0.2 and 0.1 percent of the force, respectively. By the end of 1993, the department is 12.2 percent African American and 5.6 percent Asian."
  },
  {
    "year": 1965,
    "category": "king",
    "date": "Jan. 18",
    "text": "King successfully registers to vote at the Hotel Albert in Selma, Ala. and is assaulted by James George Robinson of Birmingham."
  },
  {
    "year": 1965,
    "category": "king",
    "date": "February",
    "text": "King continues to protest discrimination in voter registration and is arrested and jailed. He meets with President Lyndon B. Johnson Feb. 9 and other American leaders about voting rights for African Americans."
  },
  {
    "year": 1965,
    "category": "rights",
    "date": "Feb. 21",
    "text": "Malcolm X is murdered. Three men are convicted of his murder."
  },
  {
    "year": 1965,
    "category": "king",
    "date": "Mar. 16-21",
    "text": "King and 3,200 people march from Selma to Montgomery"
  },
  {
    "year": 1965,
    "category": "rights",
    "date": "Aug. 6",
    "text": "President Johnson signs the Voting Rights Act of 1965. The act, which King sought, authorizes federal examiners to register qualified voters and suspends devices such as literacy tests that aimed to prevent African Americans from voting."
  },
  {
    "year": 1965,
    "category": "rights",
    "date": "Aug. 11-16",
    "text": "Watts riots leave 34 dead in Los Angeles."
  },
  {
    "year": 1968,
    "category": "king",
    "date": "Apr. 4",
    "text": "King is assassinated in Memphis, Tenn., by James Earl Ray, unleashing violence in more than 100 cities."
  },
  {
    "year": 1968,
    "category": "rights",
    "text": "In response to King's death, Seattle residents hurl firebombs, broke windows, and pelt motorists with rocks. Ten thousand people also march to Seattle Center for a rally in his memory."
  },
  {
    "year": 1968,
    "category": "rights",
    "text": "Aaron Dixon becomes first leader of Black Panther Party branch in Seattle."
  },
  {
    "year": 1968,
    "category": "rights",
    "text": "There is a rally at Garfield High in support of Dixon, Larry Gossett, and Carl Miller, sentenced to six months in the King County Jail for unlawful assembly in an earlier demonstration. Before the speakers finish, firebombs and rocks begin flying toward cars coming down 23rd Avenue. Sporadic riots break out in Seattle's Central Area during the summer."
  },
  {
    "year": 1969,
    "category": "rights",
    "text": "Edwin Pratt, executive director of the Seattle Urban League and a moderate and respected African American leader, is shot to death while standing in the doorway of his home. The murder is never solved."
  },
  {
    "year": 1977,
    "category": "rights",
    "text": "Seattle School Board adopts a plan designed to eliminate racial imbalance in schools by fall 1979."
  },
  {
    "year": 1978,
    "category": "rights",
    "text": "Seattle becomes the largest city in the United States to desegregate its schools without a court order; nearly one-quarter of the school district's students are bused as part of the \"Seattle Plan.\" Two months later, voters pass an anti-busing initiative. It is later ruled unconstitutional."
  },
  {
    "year": 1978,
    "category": "rights",
    "text": "In a blow to efforts to diversify university enrollment, the U.S. Supreme Court outlaws racial quotas in a suit brought by Allan Bakke, a white man who had been turned down by the medical school at University of California, Davis."
  },
  {
    "year": 1986,
    "category": "king",
    "date": "Jan. 20",
    "text": "The first national celebration of King's birthday as a holiday."
  },
  {
    "year": 1986,
    "category": "king",
    "date": "Feb. 24",
    "text": "King County Council passes a motion to rename King County in honor of Martin Luther King Jr."
  },
  {
    "year": 1989,
    "category": "rights",
    "text": "Douglas Wilder of Virginia becomes the nation's first African American to be elected state governor."
  },
  {
    "year": 1992,
    "category": "rights",
    "text": "The first racially based riots in years erupt in Los Angeles and other cities after a jury acquits L.A. police officers in the videotaped beating of Rodney King, an African American."
  },
  {
    "year": 2005,
    "category": "king",
    "text": "King County's name change is made official by Gov. Christine Gregoire's signing of Senate Bill 5332."
  },
  {
    "year": 2006,
    "category": "king",
    "date": "Jan. 30",
    "text": "King’s widow, Coretta Scott King, dies at age 78. Four presidents – Jimmy Carter, George H.W. Bush, Bill Clinton, George W. Bush – attended her funeral."
  },
  {
    "year": 2008,
    "category": "rights",
    "date": "Nov. 4",
    "text": "Barack Obama becomes the first African American to be elected president of the United States."
  },
  {
    "year": 2011,
    "category": "king",
    "date": "Oct. 16",
    "text": "The national memorial to Martin Luther King Jr. is dedicated and opened to the public in Washington, D.C."
  },
  {
    "year": 2013,
    "category": "rights",
    "text": "Following the death of Trayvon Martin in Sanford, Fl., the Black Lives Matter movement emerges as a new force for civil rights."
  }
]